# OSI 모형(Open Systems Interconnection Reference Model)

## OSI 모형(Open Systems Interconnection Reference Model)은 국제표준화기구(ISO)에서 개발한 모델로, 컴퓨터 네트워크 프로토콜 디자인과 통신을 계층으로 나누어 설명한 것이다. 일반적으로 OSI 7 계층 모형이라고 한다.

### OSI 7계층 모형은 프로토콜을 기능별로 나눈 것이다. 각 계층은 하위 계층의 기능만 이용, 상위 계층에게 기능을 제공

### 프로토콜 스택(스택)
### - 계층들로 구성되는 프로토콜 시스템이 구현된 시스템.
### - 하드웨어와 소프트웨어 혹은 둘의 혼합으로 구현 된다.
### - 일반적으로 하위 계층들은 하드웨어, 상위 계층들은 소프트웨어로 구현

### 계층 1 : 물리 계층(physical layer)
#### 물리 계층은 컴퓨터 네트워킹의 OSI 모형 7계층 가운데 가장 낮은, 첫 번째 계층이다. 
####이 계층의 구현 이름은 PHY라는 용어로도 불린다.
#### 물리 계층은 어떤 하나의 네트워크에서 기본 네트워크 하드웨어 전송기술들로 구성된다. 
#### 네트워크의 높은 수준의 기능의 논리 데이터 구조를 기초로 하는 필수 계층이다.
#### 다양한 특징의 하드웨어 기술이 접목되어 있기에 OSI 아키텍처에서 가장 복잡한 계층으로 간주된다.
### 계층 2 : 데이터 링크 계층
### 계층 3 : 네트워크 계층
### 계층 4 : 전송계층
### 계층 5 : 세션 계층
### 계층 6 : 표현 계층
### 계층 7 : 응용 계층

#### 출 - https://ko.wikipedia.org/wiki/OSI_%EB%AA%A8%ED%98%95
